import time
print('''Сразу скажу. Человек я- аполитичный, мне на политику п...левать, все персонажи вымышлены, а совпадения случайны. Пожалуйста, я не хочу в тюрьму
''')
print('''4 июня 1976 года родился человек, который может и хочет изменить ситуацию в России. Его имя всегда на слуху.
И имя его- Алексей Навальный. Для одних он клоун, для других- агент Госдепа, Кремля и иже с ними...
Только от вас(нет, нифига, только от меня) зависит, как пройдет его предвыборная кампания и изменится ли режим в России(только в этой игре)''')
print('\n'*2)
print('''#все варианты кроме одного заканчивают игру. СТОП, ЭТО НЕ КОММЕНТАРИЙ!?! ЧИОРТ, ВЕДЬ ТЕПЕРЬ ОНИ ВВЕДУТ AZINO777 И ПРОЙДУТ ВСЮ ИГРУ, НЕТ!!!''')
print('\n'*3)
act=input('''С чего вы начнете кампанию?
1)Сделаете акцент на разоблачении Всемогущего
2)Будете, по выражению Соловьева,"заниматься политической педофилией"
3)Заявите, что все бесполезно и закроете все штабы и ФБК
4)Перекреститесь на камеру, чтобы перестали говорить, что вы- сатанист
5)Реально продадите душу и свергните Всемогущего
6)Объявите, что каждому проголосовавшему за вас дадите сотку. Даже Саньку
7)Прийдете в мавзолей и попросите дедушку Ленина навести порядок в стране
8)618_618_618_618
9)Скажете, что раз к власти вас не пускают, вы построите свой Кремль с блэкджеком и взятками
''')
if act=='1':
    print('''Всемогущий обиделся и стал мешать вам настолько, что кампания развалилась''')
    input()
    exit()
elif act=='2':
    print('''Вас посадили за педофилию. Это фиаско, братан. Начинай заново''')
    input()
    exit()
elif act=='3':
    print('''Всемогущего и иже с ним охватила такая радость, что вся путинская шайка умерла от разрыва сердца. Лёха,PROFIT!!!''')
    input()
    exit()
elif act=='4':
    print('''Это никого не убедило. Еще и Сатана обиделся и начал помогать Всемогущему. EPIC FAIL!!!''')
    input()
    exit()
elif act=='5':
    print('''Вы вызвали дьявола, но оказалось, что кое-один человек(не будем говорить,кто это, хотя это был Всемогущий) уже попросил победу на выборах''')
    input()
    exit()
elif act=='6':
    act=print('''Все Сани России за вас. И все Владимиры тоже. Вдруг вы по 500 начнете раздавать. Лозунгом митинга 28.01.2018 стала фраза "Димон- верни лимон".
Вас воодушевляет эта идея и теперь крупнейшие мемесмейкеры страны работают на вас. Что дальше?
1)Забить на выборы и стать бизнесмемом
2)Делать мемы про власть
3)Включить в программу пункт об уголовном сроке за хранение и публикацию зашкварных мемов
4)Перестать тупить и вести себя как адекватный оппозиционер("как Навальный" тут не подходит, ведь вы и так Навальный)
''')
    if act=='1':
        print('''Народ решил, что лучше президент-бизнесмем, чем президент-коррупционер. И вы все равно президент. Ну такое''')
        input()
        exit()
    elif act=='2':
        print('''Где мемы, там и мемы про рэп. Где мемы про рэп, там рэп. Где рэп, Там вся Россия. Кароч Нэвэлный набрал 51% голосов на выборах и теперь он тут Всемогущий.
Ну, скорее Всемогущий_в_рамках_дозволенного_законом_и_народом''')
        input()
        exit()
    elif act=='3':
        print('''Вы еще не президент, но на волне новостей о сроке за негодные мемы большая часть пабликов ВК закрылась. Мемес-биржа переживает тяжкие дни. Таким гигантам, как МДК, Борщ и FTP все сложнее конкурировать и они объединяются против вас. В принципе, тот EPIC FAIL и BAD END''')
        input()
        exit()
    elif act=='4':
        print('''30 секунд
Вы переживаете экзистенциальный кризис и понимаете, что вы лишь пешка в руках школоты и что даже эти мысли не ваши, а Творца. И мысли насчет Творца тоже. И эти.
*Новости малого мира. Алексей Навальный осознал все и впал в кому, ибо он понял, что смысл жизни в том, чтобы за вас играли существа Высшего уровня и наше сознание не может это осознать*
**Вселенная возвращается в состояние космологической сингулярности и игра перестает существовать.''')
        time.sleep(30)
        exit()
    else:
       exit()
elif act=='7':
    print('''Всемогущий приказал снести мавзолей и лично похоронил Ильича. Народ терпел многое, но простить похороны Ленина уже не смог.
И режиму пришел конец. И все встало на свои места. Чиновники перестали воровать, а власть- покрывать чиновников.
Ну все, не умею я сопли разводить, Нэвэлный победил, Хэппи-энд, все окей. Почти''')
    input()
    exit()
elif act=='8':
    print('''Какая-то ОШИБКА, играй заново и ПЛОТИ НОЛОГИ''')
    input()
    exit()
elif act=='9':
    print('''Вас посадили за плагиат и нарушение авторских прав. Лёха, без шансов''')
    input()
    exit()
elif act=='ОШИБКА':
    print('''Твоя жизнь ошибка, и че дальше?''')
    input()
    exit()
elif act=='ПЛОТИ НОЛОГИ':
    print('''Прошу прощения, Всемогущий. Мигом все исправим...
______ПОЗДНА,ЗОПЛОТИ НОЛОГИ И УДОЛИ ИГРУ______''')
    time.sleep(6.66)
    exit()
elif act=='618':
    print('''GRAVITY FALLS FOREVER!!!''')
    input()
    exit()
elif act=='AZINO777':
    print('''Нижнее подчеркивание забыл''')
    input()
    exit()
elif act=='AZINO_777':
    print('''Попались. Вы реально думали, что я перепутаю комментарий с print? Наивные''')
    time.sleep(7.77)